testsuite/cht/fixedFlux/0.orig/fluid/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    sideWalls
    {
        type            fixedFluxPressure;
    }

    faceWall
    {
        type            fixedFluxPressure;
    }

    outlet
    {
        //type            fixedValue;
        type            totalPressure;
        rho             rho;
        p0              uniform 1e5;
        value           uniform 1e5;
    }

    frontAndBack
    {
        type            empty;
    }
        fluid_to_solid
    {
        type            fixedFluxPressure;
    } 
}

// ************************************************************************* //
