testsuite/cht/fixedFlux/system/solid/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


boundary
{

    top
    {
        type            mappedWall;
        inGroups        2(wall mappedPatch);
        sampleMode      nearestPatchFace;
        sampleRegion    fluid;
        samplePatch     top;
    }

    side
    {
        type            mappedWall;
        inGroups        2(wall mappedPatch);
        sampleMode      nearestPatchFace;
        sampleRegion    fluid;
        samplePatch     side;
    }

    bot
    {
        type            mappedWall;
        inGroups        2(wall mappedPatch);
        sampleMode      nearestPatchFace;
        sampleRegion    fluid;
        samplePatch     bot;
    }


}


// ************************************************************************* //
